from math import *

G = 6.6743*(10**(-11)) #гравитационная постоянная
c = 299792458 #скорость света в вакууме м/с

sun = (1.40921*(10**27), 1.9885*(10**30), 274) #объём, масса, ускорение свободного паденияs
mer = (6.083*(10**10), 3.33022*(10**23), 3.7)
ven = (9.38*(10**11), 4.8675*(10**24), 8.87)
ear = (10.8321*(10**11), 5.9726*(10**24), 9.81)
mar = (1.6318*(10**11), 6.4171*(10**23), 3.711)
jup = (1.43128*(10**15), 1.8986*(10**27), 24.79)
sat = (8.2713*(10**14), 5.6846*(10**26), 10.44)
ura = (6.833*(10**13), 8.6813*(10**25), 8.87)
nep = (6.254*(10**13), 1.0243*(10**26), 11.15)
plu = (7*(10**9), 1.3*(10**22), 0.617)

def ast():

	print("Выбери тело солнечной системы")
	planet = int(input("Солнце(1) \nМеркурий(2) \nВенера(3) \nЗемля(4) \nМарс(5)   \nЮпитер(6) \nСатурн(7) \nУран(8) \nНептун(9) \nПлутон(10)\n"))

	if planet >= 11:
		print("Введены неверные параметры")
		
		
	print("Что считаем?")
	action = int(input('Гравитационный радиус(1) \n' "Мой вес на поверхности(2) \n" ))

	if planet == 1:
		if action == 1:
			Rg = (2*(sun[1])*G)/(c**2)
			print("Гравитационный радиус: " + str(Rg) + " метров")
		elif action == 2:
			m = float(input("Введите свой вес: "))
			M = m * sun[2]
			Mm = M / 9.81
			print("Вес на поверхности будет " + str(Mm) + " кг")

	if planet == 2:
		if action == 1:
			Rg = (2*(mer[1]*G)/(c**2))
			print("Гравитационный радиус: " + str(Rg) + " метров")
		elif action == 2:
			m = float(input("Введите свой вес: "))
			M = m * mer[2]
			Mm = M / 9.81
			print("Вес на поверхности будет " + str(Mm) + " кг")

	if planet == 3:
		if action == 1:
			Rg = (2*(ven[1]*G)/(c**2))
			print("Гравитационный радиус: " + str(Rg) + " метров")
		elif action == 2:
			m = float(input("Введите свой вес: "))
			M = m * ven[2]
			Mm = M / 9.81
			print("Вес на поверхности будет " + str(Mm) + " кг")

	if planet == 4:
		if action == 1:
			Rg = (2*(ear[1]*G)/(c**2))
			print("Гравитационный радиус: " + str(Rg) + " метров")
		elif action == 2:
			m = float(input("Введите свой вес: "))
			M = m * ear[2]
			Mm = M / 9.81
			print("Вес на поверхности будет " + str(Mm) + " кг")

	if planet == 5:
		if action == 1:
			Rg = (2*(mar[1]*G)/(c**2))
			print("Гравитационный радиус: " + str(Rg) + " метров")
		elif action == 2:
			m = float(input("Введите свой вес: "))
			M = m * mar[2]
			Mm = M / 9.81
			print("Вес на поверхности будет " + str(Mm) + " кг")

	if planet == 6:
		if action == 1:
			Rg = (2*(jup[1]*G)/(c**2))
			print("Гравитационный радиус: " + str(Rg) + " метров")
		elif action == 2:
			m = float(input("Введите свой вес: "))
			M = m * jup[2]
			Mm = M / 9.81
			print("Вес на поверхности будет " + str(Mm) + " кг")

	if planet == 7:
		if action == 1:
			Rg = (2*(sat[1]*G)/(c**2))
			print("Гравитационный радиус: " + str(Rg) + " метров")
		elif action == 2:
			m = float(input("Введите свой вес: "))
			M = m * sat[2]
			Mm = M / 9.81
			print("Вес на поверхности будет " + str(Mm) + " кг")

	if planet == 8:
		if action == 1:
			Rg = (2*(ura[1]*G)/(c**2))
			print("Гравитационный радиус: " + str(Rg) + " метров")
		elif action == 2:
			m = float(input("Введите свой вес: "))
			M = m * ura[2]
			Mm = M / 9.81
			print("Вес на поверхности будет " + str(Mm) + " кг")

	if planet == 9:
		if action == 1:
			Rg = (2*(nep[1]*G)/(c**2))
			print("Гравитационный радиус: " + str(Rg) + " метров")
		elif action == 2:
			m = float(input("Введите свой вес: "))
			M = m * nep[2]
			Mm = M / 9.81
			print("Вес на поверхности будет " + str(Mm) + " кг")

	if planet == 10:
		if action == 1:
			Rg = (2*(plu[1]*G)/(c**2))
			print("Гравитационный радиус: " + str(Rg) + " метров")
		elif action == 2:
			m = float(input("Введите свой вес: "))
			M = m * plu[2]
			Mm = M / 9.81
			print("Вес на поверхности будет " + str(Mm) + " кг")

	restart = input("Повторить расчёты? (да/нет): \n")

	if restart == "да":
		ast()
	else:
		print("Спасибо за использование")
ast()


